<template>
    <div class="basis-div">
        <header>
            <div class="header-inside">
                <h1 class="headline">Müller BMW Autoschrott</h1>
                <h2 class="under-headline">ЗАПЧАСТИ НОВЫЕ И Б/У С НЕМЕЦКИХ РАЗБОРОК</h2>

                <div class="contacts">
                    <a class="number" href="tel:+79772805434">8 (977) 280-54-34</a>
                    <ul class="contacts-list list">
                        <li class="contacts-list__item" v-for="contact in contacts" :key="contact.id">
                            <a class="contact-link" :href="contact.href" target="_blank" :class="contact.name">
                                <span>
                                    {{ contact.name }}
                                </span>
                            </a>
                        </li>
                    </ul>
                </div>


            </div>
            <ul class="pages-list list">
                <li class="pages-list__item" v-for="page in pages" :key="page.id">
                    <router-link class="router" :to="page.to">{{ page.name }}</router-link>
                </li>
            </ul>
        </header>

        <main>
            <div class="block">
                <button type="button" class="desc-button" id="history5" @click="openBlock">История 5-ой серии</button>
                <div class="hidden-div history none" id="history5">
                    <p class="text">
                        BMW 1500, представленный в 1961 году, можно считать прародителем 5-й серии. Эта модель получила
                        большой успех и вернуло бренд с бело-синим пропеллером (BMW использовался для производства
                        авиационных двигателей) обратно в зону прибыли. Позже были добавлены модели 1800 и 2000.
                    </p>
                    <h3 class="img-headline">BMW 1500</h3>
                    <img class="bmw-img bmw-1500" src="@/img/bmw-1500.jpg" alt="BMW 1500" />
                    <p class="text">
                        В 1972 году были представлены новые названия моделей, начиная с 5-й серии. Пятая серия,
                        известная
                        внутри
                        компании как E12, первоначально предлагалась как 520 и 520i мощностью 115 и 130 л.с. За ним
                        последовала
                        модель 525 в 1973 году с мощностью 145 л.с., а в 1974 году — 518 с мощностью 90 л.с. Год спустя
                        был
                        доступен 528-й двигатель мощностью 165 л.с. Первая визуальная ретушь повторилась год спустя:
                        были
                        пересмотрены передняя и задняя части. В 1977 году шестицилиндровый двигатель M20 новой
                        конструкции
                        заменил четырехцилиндровый двигатель модели 520. Топ-моделью стала 528i с электронным впрыском
                        топлива.
                        Компания M-GmbH довольно рано начала оснащать E12 двигателями объемом от 3 до 3,5 литров. Хотя
                        изначально они не фигурировали ни в каких официальных прайс-листах, их практически можно было
                        купить
                        из-под прилавка по запросу. Лишь позже M535i официально поступил в продажу. Всего было построено
                        около
                        700 000 E12.
                    </p>
                    <h3 class="img-headline">BMW E12</h3>
                    <img class="bmw-img bmw-e12" src="@/img/bmw-e12.jpg" alt="BMW E12" />
                    <p class="text">Следующее поколение 5-й серии E28 было представлено в мае 1981 года. По сравнению с
                        E12
                        он,
                        похоже, изменился незначительно, поскольку использовался тот же базовый корпус. Однако были
                        изменены
                        передняя, задняя, боковые стороны и интерьер. Все двигатели, кроме 518, теперь имеют впрыск
                        топлива.
                        У
                        520i теперь 125 л.с., у 525i — 150 л.с., а у 528i — 184 л.с. Хотя это так не выглядит, под
                        листовым
                        металлом произошло многое: например, передняя ось была заимствована у 7-й серии и введен
                        индикатор
                        интервала технического обслуживания. Через несколько лет линейка двигателей была расширена за
                        счет
                        модели 525eta, за которой позже последовали M535i и M5. После того, как было выпущено около 705
                        000
                        автомобилей, производство E28 было прекращено в декабре 1987 года. Из-за базового кузова Е12
                        внешний
                        вид
                        воспринимается старым.</p>
                    <h3 class="img-headline">BMW E28</h3>
                    <img class="bmw-img bmw-e28" src="@/img/bmw-e28.jpg" alt="BMW E28" />
                    <p class="text">
                        E34 теперь добился значительного визуального и технического прогресса. С февраля 1988 года он
                        был
                        доступен только с шестицилиндровыми двигателями 520i (129 л.с.), 525i (170 л.с.), 530i (188
                        л.с.) и
                        535i
                        (211 л.с.), месяцем позже последовал дизельный 524td (115 л.с.). M5 мощностью 315 л.с. появился
                        на
                        рынке
                        в сентябре того же года. В апреле 1990 года были представлены четырехклапанные двигатели M50,
                        обеспечивающие большую мощность у 520i (150 л.с.) и у 525i (192 л.с.). Самым маленьким
                        двигателем
                        был
                        518i с четырьмя цилиндрами и мощностью 113 л.с., который позже был заменен более новым
                        двигателем
                        M43 с
                        цепным приводом мощностью 115 л.с. Версия универсал Touring последовала с сентября,
                        полноприводную
                        версию 525ix и новые дизельные 525td и 525tds можно было приобрести месяцем позже. С мая 1992
                        года
                        новый
                        двигатель М5 мощностью 340 л.с. обеспечивал еще большую тягу, с сентября двигатели М50 получили
                        больший
                        крутящий момент в нижнем диапазоне оборотов благодаря технологии Vanos и был проведен первый
                        небольшой
                        фейслифтинг, включавший новые наружные зеркала, среди прочего. Месяц спустя был представлен
                        двигатель
                        M60 V8, который выдавал 218 л.с. у 530i и 286 л.с. у 540i и выглядел значительно внушительнее
                        благодаря
                        более широкой решетке радиатора. Производство старого двигателя для 530i и 535i было прекращено.
                        С
                        1995
                        года продавался Touring 518g, особенность которого заключалась в двухвалентном приводе
                        (газ/бензин).
                        Последний фейслифтинг должен был состояться в конце 1994 года, и отныне все модели имели широкую
                        решетку
                        радиатора. В ноябре 1995 года производство E34 прекратилось, и на смену ему пришла E39. E34
                        Touring
                        продолжал выпускаться до 1996 года. Всего в Германии было построено ровно 1 166 312 седанов E34
                        и
                        124
                        656 E34 Touring. Кроме того, из комплектов деталей на заводах BMW за рубежом было изготовлено 42
                        470
                        седанов E34. Всего с конвейера сошло 1 333 438 E34, в том числе 11 984 M5.
                    </p>
                    <h3 class="img-headline">BMW E34</h3>
                    <img class="bmw-img bmw-e34" src="@/img/bmw-e34.jpg" alt="BMW E34" />
                </div>
            </div>
            <div class="block">
                <button type="button" class="desc-button" id="history34" @click="openBlock">История модели е34</button>
                <table cellpadding="12" cellspacing="0" class="hidden-div history none" id="history34">
                    <tbody>
                        <tr>
                            <td>02/1988</td>
                            <td>
                                - Выпуск 520i M20 (129 л.с.)<br>
                                - Выпуск 525i M20 (170 л.с.)<br>
                                - Выпуск 530i M30 (188 л.с.)<br>
                                - Выпуск 535i M30 (211 л.с.)
                            </td>
                        </tr>
                        <tr>
                            <td>03/1988</td>
                            <td>
                                - Выпуск 524td (турбодизель, 115 л.с.)
                            </td>
                        </tr>
                        <tr>
                            <td>09/1988</td>
                            <td>
                                - Выпуск M5 3.6 (315 л.с.)<br>
                                - Серповидный вырез под линзы ближнего света
                            </td>
                        </tr>
                        <tr>
                            <td>02/1989</td>
                            <td>
                                - изменена верхняя комбинация приборов
                            </td>
                        </tr>
                        <tr>
                            <td>02/1990</td>
                            <td>
                                - Выпуск четырехклапанных двигателей M50 в моделях 520i (150 л.с.) и 525i (192 л.с.)<br>
                                - Снят с производства 520i M20 (129 л.с.)<br>
                                - Снят с производства 525i M20 (170 л.с.)<br>
                                - Снят с производства 530i M30 (188 л.с.)
                            </td>
                        </tr>
                        <tr>
                            <td>09/1990</td>
                            <td>
                                - Механическая коробка передач с прямой передачей от ZF для 525i (ранее повышающая
                                передача
                                от Getrag)<br>
                                - 5-ступенчатая АКПП от ZF для 520i и 525i (ранее 4-ступенчатая от GM)<br>
                                - Модифицированная верхняя комбинация приборов<br>
                                - Модифицированная нижняя комбинация приборов (цифровой вместо механического
                                одометра)<br>
                                - Доработан подогрев сидений
                            </td>
                        </tr>
                        <tr>
                            <td>01/1991</td>
                            <td>
                                - Механическая коробка передач с прямой передачей от ZF для 520i (ранее повышающая
                                передача
                                от Getrag)
                            </td>
                        </tr>
                        <tr>
                            <td>09/1991</td>
                            <td>
                                - Выпуск модели универсал Touring.<br>
                                - Выпуск 525тдс (турбодизель, 143 л.с.)<br>
                                - Снят с производства 524td (115 л.с.)<br>
                                - Защита от бокового удара<br>
                                - Наружные дверные ручки из пластика вместо металла<br>
                                - Изменены материалы обивки в салоне<br>
                                - Модифицированный центральный замок<br>
                                - Поменян круиз-контроль<br>
                                - Изменён корректор фар<br>
                                - Изменено написание модели (курсив вместо прямого)<br>
                                - Все стеклоподъемники автоматически полностью опускаются одним нажатием кнопки
                            </td>
                        </tr>
                        <tr>
                            <td>10/1991</td>
                            <td>
                                - Выпуск 525ix (192 л.с., полный привод)
                            </td>
                        </tr>
                        <tr>
                            <td>12/1991</td>
                            <td>
                                - Выпуск M5 3.8 (340 л.с.)<br>
                                - Снят с производства M5 3.6 (315 л.с.)
                            </td>
                        </tr>
                        <tr>
                            <td>03/1992</td>
                            <td>
                                - Выпуск M5 3.8 Touring (340 л.с.)
                            </td>
                        </tr>
                        <tr>
                            <td>05/1992</td>
                            <td>
                                - ABS теперь входит в стандартную комплектацию всех E34 (ранее только с 525i)
                            </td>
                        </tr>
                        <tr>
                            <td>09/1992</td>
                            <td>
                                - Выпуск 530i M60 (218 л.с.)<br>
                                - Выпуск 540i M60 (286 л.с.), первоначально только с 5-ступенчатой автоматической
                                коробкой
                                передач<br>
                                - Устранен 535i (211 л.с.)<br>
                                - Техническая доработка двигателей М50 (Ванос)<br>
                                - Модифицированные наружные зеркала в дизайне E36<br>
                                - Подушка безопасности водителя входит в стандартную комплектацию всех моделей BMW<br>
                                - Пассажирская подушка безопасности доступна за дополнительную плату<br>
                                - Передние электрические стеклоподъемники в стандартной комплектации для 525i
                            </td>
                        </tr>
                        <tr>
                            <td>03/1993</td>
                            <td>
                                - Выпуск 525td (турбодизель, 115 л.с.)<br>
                                - Выпуск 518i M40 (113 л.с.)
                            </td>
                        </tr>
                        <tr>
                            <td>09/1993</td>
                            <td>
                                - 540i с адаптивным управлением трансмиссией<br>
                                - Дверные вставки для кожаного салона теперь выполнены из гофрированной кожи<br>
                                - модифицированные стеклоподъемники<br>
                                - изменен дизайн заслонки на рулевом колесе с подушкой безопасности
                            </td>
                        </tr>
                        <tr>
                            <td>01/1994</td>
                            <td>
                                - модифицированный ТНВД для 525td и 525tds
                            </td>
                        </tr>
                        <tr>
                            <td>03/1994</td>
                            <td>
                                - Представление модели 540i с 6-ступенчатой механической коробкой передач, увеличение
                                предельной скорости V-max с 240 до 250 км/ч.<br>
                                - Внедрение пакета оборудования «Представительский» для 518i, 520i, 525i, 525td и 525tds
                                (оборудование аналогично 530i)
                            </td>
                        </tr>
                        <tr>
                            <td>04/1994</td>
                            <td>
                                - Выпуск 518i M43 (115 л.с.)<br>
                                - Устранен 518i M40 (113 л.с.)<br>
                                - широкая решетка радиатора для всех моделей E34 (ранее только для моделей V8 530i и
                                540i)<br>
                                - Грубые полоски на бамперах вместо гладких
                            </td>
                        </tr>
                        <tr>
                            <td>05/1994</td>
                            <td>
                                - M5 3.8 теперь с 6-ступенчато механической коробкой передач, увеличенной тормозной
                                системой
                                и 18-дюймовыми шинами<br>
                                - модифицированные рули (цветные вместо черных эмблем BMW)<br>
                                - Пороги, передняя и задняя панели в цвет кузова в стандартной комплектации от 530i
                            </td>
                        </tr>
                        <tr>
                            <td>01/1995</td>
                            <td>
                                - Подушка безопасности пассажира в стандартной комплектации<br>
                                - Введение EWS-II в качестве полностью интегрированного иммобилайзера с транспондером в
                                каждом ключе
                            </td>
                        </tr>
                        <tr>
                            <td>05/1995</td>
                            <td>
                                - Выпуск 518g Touring (115 л.с., двухвалентный, с газовым приводом)
                            </td>
                        </tr>
                        <tr>
                            <td>12/1995</td>
                            <td>
                                - прекращено производство седана E34
                            </td>
                        </tr>
                        <tr>
                            <td>06/1996</td>
                            <td>
                                - Производство E34 Touring прекращено
                            </td>
                        </tr>
                    </tbody>
                </table>

            </div>
            <div class="block">
                <button type="button" class="desc-button" id="historydiesel" @click="openBlock">Технические данные
                    дизельных двигателей Е34</button>
                <div class="scroll-table">
                    <table cellpadding="5" cellspacing="0" class="hidden-div historydiesel none hidden-table"
                        id="historydiesel">
                        <tbody>
                            <tr>
                                <td valign="top" width="64%">
                                    <b>Технические данные дизельных шестицилиндровых двигателей М21 и М51</b><br>
                                    <table cols="10" width="100%">
                                        <tbody>
                                            <tr>
                                                <td>
                                                    Модель
                                                </td>
                                                <td>
                                                    524td
                                                </td>
                                                <td>
                                                    525td
                                                </td>
                                                <td>
                                                    525tds
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Маркировка
                                                </td>
                                                <td>
                                                    M21D24
                                                </td>
                                                <td>
                                                    M51D25
                                                </td>
                                                <td>
                                                    M51D25
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Клапаны/цилиндры
                                                </td>
                                                <td>
                                                    2
                                                </td>
                                                <td>
                                                    2
                                                </td>
                                                <td>
                                                    2
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Привод распределительного вала
                                                </td>
                                                <td>
                                                    Ремень ГРМ
                                                </td>
                                                <td>
                                                    Цепь ГРМ
                                                </td>
                                                <td>
                                                    Цепь ГРМ
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Наддув
                                                </td>
                                                <td>
                                                    Турбокомпрессор
                                                </td>
                                                <td>
                                                    Турбокомпрессор
                                                </td>
                                                <td>
                                                    Турбокомпрессор + Интеркулер
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Тип топлива
                                                </td>
                                                <td>
                                                    Дизель
                                                </td>
                                                <td>
                                                    Дизель
                                                </td>
                                                <td>
                                                    Дизель
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Отверстие [мм]
                                                </td>
                                                <td>
                                                    80
                                                </td>
                                                <td>
                                                    80
                                                </td>
                                                <td>
                                                    80
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Ход [мм]
                                                </td>
                                                <td>
                                                    81
                                                </td>
                                                <td>
                                                    82,8
                                                </td>
                                                <td>
                                                    82,8
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Объем [см3]
                                                </td>
                                                <td>
                                                    2443
                                                </td>
                                                <td>
                                                    2499
                                                </td>
                                                <td>
                                                    2499
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Сжатие [x:1]
                                                </td>
                                                <td>
                                                    22
                                                </td>
                                                <td>
                                                    22
                                                </td>
                                                <td>
                                                    22
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Мощность [кВт/л.с.]
                                                </td>
                                                <td>
                                                    85/115
                                                </td>
                                                <td>
                                                    85/115
                                                </td>
                                                <td>
                                                    105/143
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    На скорости [1/мин]
                                                </td>
                                                <td>
                                                    4800
                                                </td>
                                                <td>
                                                    4800
                                                </td>
                                                <td>
                                                    4800
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Крутящий момент [Нм]
                                                </td>
                                                <td>
                                                    220
                                                </td>
                                                <td>
                                                    222
                                                </td>
                                                <td>
                                                    260
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    На скорости [1/мин]
                                                </td>
                                                <td>
                                                    2400
                                                </td>
                                                <td>
                                                    1900
                                                </td>
                                                <td>
                                                    2200
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Давление сжатия [бар]
                                                </td>
                                                <td>
                                                    >20
                                                </td>
                                                <td>
                                                    >20
                                                </td>
                                                <td>
                                                    >20
                                                </td>
                                            </tr>
                                        </tbody>
                                    </table>

                                </td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <div class="block">
                <button type="button" class="desc-button" id="historyfour" @click="openBlock">Технические данные
                    четырехцилиндровых двигателей E34</button>
                <table cellspacing="0" cellpadding="5" class="hidden-div historyfour none hidden-table"
                    id="historyfour">
                    <tbody>
                        <tr>
                            <td valign="top" width="64%">
                                <b>Технические данные четырехцилиндровых двигателей М40 и М43</b><br>
                                <table cols="10" width="100%">
                                    <tbody>
                                        <tr>
                                            <td>
                                                Модель
                                            </td>
                                            <td>
                                                518i
                                            </td>
                                            <td>
                                                518i
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Маркировка
                                            </td>
                                            <td>
                                                M40B18
                                            </td>
                                            <td>
                                                M43B18
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Клапаны/цилиндры
                                            </td>
                                            <td>
                                                2
                                            </td>
                                            <td>
                                                2
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Привод распределительного вала
                                            </td>
                                            <td>
                                                Ремень ГРМ
                                            </td>
                                            <td>
                                                Цепь ГРМ
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Тип топлива
                                            </td>
                                            <td>
                                                95 бензин
                                            </td>
                                            <td>
                                                95 бензин
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Отверстие [мм]
                                            </td>
                                            <td>
                                                84
                                            </td>
                                            <td>
                                                84
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Ход [мм]
                                            </td>
                                            <td>
                                                81
                                            </td>
                                            <td>
                                                81
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Объем [см3]
                                            </td>
                                            <td>
                                                1796
                                            </td>
                                            <td>
                                                1796
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Сжатие [x:1]
                                            </td>
                                            <td>
                                                8,8
                                            </td>
                                            <td>
                                                9,7
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Мощность [кВт/л.с.]
                                            </td>
                                            <td>
                                                83/113
                                            </td>
                                            <td>
                                                85/115
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                На скорости [1/мин]
                                            </td>
                                            <td>
                                                5500
                                            </td>
                                            <td>
                                                5500
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Крутящий момент [Нм]
                                            </td>
                                            <td>
                                                162
                                            </td>
                                            <td>
                                                168
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                На скорости [1/мин]
                                            </td>
                                            <td>
                                                4250
                                            </td>
                                            <td>
                                                3900
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Давление сжатия [бар]
                                            </td>
                                            <td>
                                                10-11
                                            </td>
                                            <td>
                                                10-11
                                            </td>
                                        </tr>
                                    </tbody>
                                </table>

                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
            <div class="block">
                <button type="button" class="desc-button" id="historysix" @click="openBlock">Технические данные
                    шестицилиндровых двигателей E34</button>
                <div class="scroll-table">
                    <table cellspacing="0" cellpadding="5" class="hidden-div historysix none hidden-table"
                        id="historysix">
                        <tbody>
                            <tr>
                                <td valign="top">
                                    <b>Технические данные шестицилиндровых двигателей М20, М30, М50 и S38</b><br>
                                    <table cols="10" width="100%">
                                        <tbody>
                                            <tr>
                                                <td>
                                                    Модель
                                                </td>
                                                <td>
                                                    520i
                                                </td>
                                                <td>
                                                    525i
                                                </td>
                                                <td>
                                                    520i
                                                </td>
                                                <td>
                                                    525i
                                                </td>
                                                <td>
                                                    530i
                                                </td>
                                                <td>
                                                    535i
                                                </td>
                                                <td>
                                                    M5 3.6
                                                </td>
                                                <td>
                                                    M5 3.8
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Маркировка
                                                </td>
                                                <td>
                                                    M20B20
                                                </td>
                                                <td>
                                                    M20B25
                                                </td>
                                                <td>
                                                    M50B20
                                                </td>
                                                <td>
                                                    M50B25
                                                </td>
                                                <td>
                                                    M30B30
                                                </td>
                                                <td>
                                                    M30B35
                                                </td>
                                                <td>
                                                    S38B36
                                                </td>
                                                <td>
                                                    S38B38
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Клапаны/цилиндры
                                                </td>
                                                <td>
                                                    2
                                                </td>
                                                <td>
                                                    2
                                                </td>
                                                <td>
                                                    4
                                                </td>
                                                <td>
                                                    4
                                                </td>
                                                <td>
                                                    2
                                                </td>
                                                <td>
                                                    2
                                                </td>
                                                <td>
                                                    4
                                                </td>
                                                <td>
                                                    4
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Привод распределительного вала
                                                </td>
                                                <td>
                                                    Ремень ГРМ
                                                </td>
                                                <td>
                                                    Ремень ГРМ
                                                </td>
                                                <td>
                                                    Цепь ГРМ
                                                </td>
                                                <td>
                                                    Цепь ГРМ
                                                </td>
                                                <td>
                                                    Цепь ГРМ
                                                </td>
                                                <td>
                                                    Цепь ГРМ
                                                </td>
                                                <td>
                                                    Цепь ГРМ
                                                </td>
                                                <td>
                                                    Цепь ГРМ
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Тип топлива
                                                </td>
                                                <td>
                                                    92 бензин
                                                </td>
                                                <td>
                                                    92 бензин
                                                </td>
                                                <td>
                                                    95 бензин
                                                </td>
                                                <td>
                                                    95 бензин
                                                </td>
                                                <td>
                                                    92 бензин
                                                </td>
                                                <td>
                                                    92 бензин
                                                </td>
                                                <td>
                                                    95 бензин
                                                </td>
                                                <td>
                                                    95 бензин
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Отверстие [мм]
                                                </td>
                                                <td>
                                                    80
                                                </td>
                                                <td>
                                                    84
                                                </td>
                                                <td>
                                                    80
                                                </td>
                                                <td>
                                                    84
                                                </td>
                                                <td>
                                                    89
                                                </td>
                                                <td>
                                                    92
                                                </td>
                                                <td>
                                                    93,4
                                                </td>
                                                <td>
                                                    94,6
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Ход [мм]
                                                </td>
                                                <td>
                                                    66
                                                </td>
                                                <td>
                                                    75
                                                </td>
                                                <td>
                                                    66
                                                </td>
                                                <td>
                                                    75
                                                </td>
                                                <td>
                                                    80
                                                </td>
                                                <td>
                                                    86
                                                </td>
                                                <td>
                                                    86
                                                </td>
                                                <td>
                                                    90
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Объем [см3]
                                                </td>
                                                <td>
                                                    1990
                                                </td>
                                                <td>
                                                    2494
                                                </td>
                                                <td>
                                                    1990
                                                </td>
                                                <td>
                                                    2494
                                                </td>
                                                <td>
                                                    2986
                                                </td>
                                                <td>
                                                    3430
                                                </td>
                                                <td>
                                                    3535
                                                </td>
                                                <td>
                                                    3795
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Сжатие [x:1]
                                                </td>
                                                <td>
                                                    8,8
                                                </td>
                                                <td>
                                                    8,8
                                                </td>
                                                <td>
                                                    10,5/10,5*
                                                </td>
                                                <td>
                                                    10,0/10,5*
                                                </td>
                                                <td>
                                                    9,0
                                                </td>
                                                <td>
                                                    9,0
                                                </td>
                                                <td>
                                                    10,0
                                                </td>
                                                <td>
                                                    10,5
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Мощность [кВт/л.с.]
                                                </td>
                                                <td>
                                                    95/129
                                                </td>
                                                <td>
                                                    125/170
                                                </td>
                                                <td>
                                                    110/150
                                                </td>
                                                <td>
                                                    141/192
                                                </td>
                                                <td>
                                                    135/188
                                                </td>
                                                <td>
                                                    155/211
                                                </td>
                                                <td>
                                                    232/315
                                                </td>
                                                <td>
                                                    250/340
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    На скорости [1/мин]
                                                </td>
                                                <td>
                                                    6000
                                                </td>
                                                <td>
                                                    5800
                                                </td>
                                                <td>
                                                    6000/5900*
                                                </td>
                                                <td>
                                                    6000/5900*
                                                </td>
                                                <td>
                                                    5800
                                                </td>
                                                <td>
                                                    5700
                                                </td>
                                                <td>
                                                    6900
                                                </td>
                                                <td>
                                                    6900
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Крутящий момент [Нм]
                                                </td>
                                                <td>
                                                    164
                                                </td>
                                                <td>
                                                    222
                                                </td>
                                                <td>
                                                    190/190*
                                                </td>
                                                <td>
                                                    245/250*
                                                </td>
                                                <td>
                                                    260
                                                </td>
                                                <td>
                                                    305
                                                </td>
                                                <td>
                                                    360
                                                </td>
                                                <td>
                                                    400
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    На скорости [1/мин]
                                                </td>
                                                <td>
                                                    4300
                                                </td>
                                                <td>
                                                    4300
                                                </td>
                                                <td>
                                                    4700/4200*
                                                </td>
                                                <td>
                                                    4700/4200*
                                                </td>
                                                <td>
                                                    4000
                                                </td>
                                                <td>
                                                    4000
                                                </td>
                                                <td>
                                                    4750
                                                </td>
                                                <td>
                                                    4750
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    Давление сжатия [бар]
                                                </td>
                                                <td>
                                                    10-11
                                                </td>
                                                <td>
                                                    10-11
                                                </td>
                                                <td>
                                                    10-11
                                                </td>
                                                <td>
                                                    10-11
                                                </td>
                                                <td>
                                                    10-11
                                                </td>
                                                <td>
                                                    10-11
                                                </td>
                                                <td>
                                                    10-11
                                                </td>
                                                <td>
                                                    10-11
                                                </td>
                                            </tr>
                                        </tbody>
                                    </table>
                                    <br>
                                    * = Ванос-Модель
                                </td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <div class="block">
                <button type="button" class="desc-button" id="historyv8" @click="openBlock">Технические данные
                    двигателей
                    E34 V8</button>
                <table cellspacing="0" cellpadding="5" class="hidden-div historyv8 none hidden-table" id="historyv8">
                    <tbody>
                        <tr>
                            <td valign="top" width="64%">
                                <b>Технические данные двигателя V8 M60</b><br>
                                <table cols="10" width="100%">
                                    <tbody>
                                        <tr>
                                            <td>
                                                Модель
                                            </td>
                                            <td>
                                                530i
                                            </td>
                                            <td>
                                                540i
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Маркировка
                                            </td>
                                            <td>
                                                M60B30
                                            </td>
                                            <td>
                                                M60B40
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Клапаны/цилиндры
                                            </td>
                                            <td>
                                                4
                                            </td>
                                            <td>
                                                4
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Привод распределительного вала
                                            </td>
                                            <td>
                                                Цепь ГРМ
                                            </td>
                                            <td>
                                                Цепь ГРМ
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Тип топлива
                                            </td>
                                            <td>
                                                95 бензин
                                            </td>
                                            <td>
                                                95 бензин
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Отверстие [мм]
                                            </td>
                                            <td>
                                                84
                                            </td>
                                            <td>
                                                89
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Ход [мм]
                                            </td>
                                            <td>
                                                67,6
                                            </td>
                                            <td>
                                                80
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Объем [см3]
                                            </td>
                                            <td>
                                                2997
                                            </td>
                                            <td>
                                                3982
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Сжатие [x:1]
                                            </td>
                                            <td>
                                                10,5
                                            </td>
                                            <td>
                                                10,0
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Мощность [кВт/л.с.]
                                            </td>
                                            <td>
                                                160/218
                                            </td>
                                            <td>
                                                210/286
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                На скорости [1/мин]
                                            </td>
                                            <td>
                                                5800
                                            </td>
                                            <td>
                                                5800
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Крутящий момент [Нм]
                                            </td>
                                            <td>
                                                290
                                            </td>
                                            <td>
                                                400
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                На скорости [1/мин]
                                            </td>
                                            <td>
                                                4500
                                            </td>
                                            <td>
                                                4500
                                            </td>
                                        </tr>
                                        <tr>
                                            <td>
                                                Давление сжатия [бар]
                                            </td>
                                            <td>
                                                12-14
                                            </td>
                                            <td>
                                                12-14
                                            </td>
                                        </tr>
                                    </tbody>
                                </table>

                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
            <div class="block">
                <button type="button" class="desc-button button-historytactics" id="historytactics"
                    @click="openBlock">Тактико-технические
                    характеристики серии Е34</button>
                <div class="scroll-table">
                    <table cellspacing="0" cellpadding="5" class="hidden-div historysix none hidden-table"
                        id="historytactics">
                        <tbody>
                            <tr>
                                <td valign="top" width="64%">
                                    <b>E34 седан</b><br>
                                    <table cols="10" width="100%">
                                        <tbody>
                                            <tr>
                                                <td>
                                                    Модель
                                                </td>
                                                <td>
                                                    Мотор
                                                </td>
                                                <td>
                                                    Производительность
                                                </td>
                                                <td>
                                                    Максимальная скорость
                                                </td>
                                                <td>
                                                    0-100км/ч:
                                                </td>
                                                <td>
                                                    Годы выпуска:
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    518i
                                                </td>
                                                <td>
                                                    M40B18 4-цилиндровый
                                                </td>
                                                <td>
                                                    113 л.с.
                                                </td>
                                                <td>
                                                    192 км/ч
                                                </td>
                                                <td>
                                                    12.4 сек
                                                </td>
                                                <td>
                                                    1989 - 1993
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    518i
                                                </td>
                                                <td>
                                                    M43B18 4-цилиндровый
                                                </td>
                                                <td>
                                                    115 л.с.
                                                </td>
                                                <td>
                                                    198 км/ч
                                                </td>
                                                <td>
                                                    12.4 сек
                                                </td>
                                                <td>
                                                    1994 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    520i
                                                </td>
                                                <td>
                                                    M20B20 6-цилиндровый
                                                </td>
                                                <td>
                                                    129 л.с.
                                                </td>
                                                <td>
                                                    204 км/ч
                                                </td>
                                                <td>
                                                    11.9 сек
                                                </td>
                                                <td>
                                                    1988 - 1990
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    520i
                                                </td>
                                                <td>
                                                    M50B20 6-цилиндровый
                                                </td>
                                                <td>
                                                    150 л.с.
                                                </td>
                                                <td>
                                                    211 км/ч
                                                </td>
                                                <td>
                                                    10.6 сек
                                                </td>
                                                <td>
                                                    1990 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    525i
                                                </td>
                                                <td>
                                                    M20B25 6-цилиндровый
                                                </td>
                                                <td>
                                                    170 л.с.
                                                </td>
                                                <td>
                                                    221 км/ч
                                                </td>
                                                <td>
                                                    9.5 сек
                                                </td>
                                                <td>
                                                    1988 - 1990
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    525i
                                                </td>
                                                <td>
                                                    M50B25 6-цилиндровый
                                                </td>
                                                <td>
                                                    192 л.с.
                                                </td>
                                                <td>
                                                    230 км/ч
                                                </td>
                                                <td>
                                                    8.6 сек
                                                </td>
                                                <td>
                                                    1990 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    525ix
                                                </td>
                                                <td>
                                                    M50B25 6-цилиндровый
                                                </td>
                                                <td>
                                                    192 л.с.
                                                </td>
                                                <td>
                                                    220 км/ч
                                                </td>
                                                <td>
                                                    9.5 сек
                                                </td>
                                                <td>
                                                    1992 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    530i
                                                </td>
                                                <td>
                                                    M30B30 6-цилиндровый
                                                </td>
                                                <td>
                                                    188 л.с.
                                                </td>
                                                <td>
                                                    227 км/ч
                                                </td>
                                                <td>
                                                    8.6 сек
                                                </td>
                                                <td>
                                                    1988 - 1990
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    530i
                                                </td>
                                                <td>
                                                    M60B30 8-цилиндровый
                                                </td>
                                                <td>
                                                    218 л.с.
                                                </td>
                                                <td>
                                                    235 км/ч
                                                </td>
                                                <td>
                                                    7.7 сек
                                                </td>
                                                <td>
                                                    1992 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    535i
                                                </td>
                                                <td>
                                                    M30B35 6-цилиндровый
                                                </td>
                                                <td>
                                                    211 л.с.
                                                </td>
                                                <td>
                                                    235 км/ч
                                                </td>
                                                <td>
                                                    7.7 сек
                                                </td>
                                                <td>
                                                    1999 - 1992
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    540i
                                                </td>
                                                <td>
                                                    M60B40 8-цилиндровый
                                                </td>
                                                <td>
                                                    286 л.с.
                                                </td>
                                                <td>
                                                    240 км/ч**
                                                </td>
                                                <td>
                                                    6.8 сек
                                                </td>
                                                <td>
                                                    1992 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    M5 3.6
                                                </td>
                                                <td>
                                                    S38B36 6-цилиндровый
                                                </td>
                                                <td>
                                                    315 л.с.
                                                </td>
                                                <td>
                                                    250 км/ч*
                                                </td>
                                                <td>
                                                    6.3 сек
                                                </td>
                                                <td>
                                                    1988 - 1991
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    M5 3.8
                                                </td>
                                                <td>
                                                    S38B38 6-цилиндровый
                                                </td>
                                                <td>
                                                    340 л.с.
                                                </td>
                                                <td>
                                                    250 км/ч*
                                                </td>
                                                <td>
                                                    5.9 сек
                                                </td>
                                                <td>
                                                    1991 - 1995
                                                </td>
                                            </tr>
                                            <br>
                                            <tr>
                                                <td>
                                                    524td
                                                </td>
                                                <td>
                                                    M21D24 6-цилиндровый
                                                </td>
                                                <td>
                                                    115 л.с.
                                                </td>
                                                <td>
                                                    192 км/ч
                                                </td>
                                                <td>
                                                    12.9 сек
                                                </td>
                                                <td>
                                                    1988 - 1992
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    525td
                                                </td>
                                                <td>
                                                    M51D25 6-цилиндровый
                                                </td>
                                                <td>
                                                    115 л.с.
                                                </td>
                                                <td>
                                                    194 км/ч
                                                </td>
                                                <td>
                                                    12.9 сек
                                                </td>
                                                <td>
                                                    1993 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    525tds
                                                </td>
                                                <td>
                                                    M51D25 6-цилиндровый
                                                </td>
                                                <td>
                                                    143 л.с.
                                                </td>
                                                <td>
                                                    207 км/ч
                                                </td>
                                                <td>
                                                    11.0 сек
                                                </td>
                                                <td>
                                                    1991 - 1995
                                                </td>
                                            </tr>
                                        </tbody>
                                    </table>
                                    <br>
                                    * = Vanos-Модель
                                </td>
                            </tr>
                        </tbody>
                    </table>
                    <table cellspacing="0" cellpadding="5" class="hidden-div historysix none hidden-table"
                        id="historytactics">
                        <tbody>
                            <tr>
                                <td valign="top" width="64%">
                                    <b>E34 туринг</b><br>
                                    <table cols="10" width="100%">
                                        <tbody>
                                            <tr>
                                                <td>
                                                    Модель
                                                </td>
                                                <td>
                                                    Мотор
                                                </td>
                                                <td>
                                                    Производительность
                                                </td>
                                                <td>
                                                    Максимальная скорость
                                                </td>
                                                <td>
                                                    0-100км/ч:
                                                </td>
                                                <td>
                                                    Годы выпуска:
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    518g***
                                                </td>
                                                <td>
                                                    M43B18 4-цилиндровый
                                                </td>
                                                <td>
                                                    105 л.с. / 115 л.с.
                                                </td>
                                                <td>
                                                    190 км/ч
                                                </td>
                                                <td>
                                                    13.5 сек
                                                </td>
                                                <td>
                                                    1995 - 1996
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    518i
                                                </td>
                                                <td>
                                                    M40B18 4-цилиндровый
                                                </td>
                                                <td>
                                                    113 л.с.
                                                </td>
                                                <td>
                                                    186 км/ч
                                                </td>
                                                <td>
                                                    13.6 сек
                                                </td>
                                                <td>
                                                    1992 - 1993
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    518i
                                                </td>
                                                <td>
                                                    M43B18 4-цилиндровый
                                                </td>
                                                <td>
                                                    115 л.с.
                                                </td>
                                                <td>
                                                    190 км/ч
                                                </td>
                                                <td>
                                                    13.4 сек
                                                </td>
                                                <td>
                                                    1995 - 1996
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    520i
                                                </td>
                                                <td>
                                                    M50B20 6-цилиндровый
                                                </td>
                                                <td>
                                                    150 л.с.
                                                </td>
                                                <td>
                                                    205 км/ч
                                                </td>
                                                <td>
                                                    11.3 сек
                                                </td>
                                                <td>
                                                    1992 - 1996
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    525i
                                                </td>
                                                <td>
                                                    M50B25 6-цилиндровый
                                                </td>
                                                <td>
                                                    192 л.с.
                                                </td>
                                                <td>
                                                    221 км/ч
                                                </td>
                                                <td>
                                                    9.2 сек
                                                </td>
                                                <td>
                                                    1992 - 1996
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    525ix
                                                </td>
                                                <td>
                                                    M50B25 6-цилиндровый
                                                </td>
                                                <td>
                                                    192 л.с.
                                                </td>
                                                <td>
                                                    215 км/ч
                                                </td>
                                                <td>
                                                    10.0 сек
                                                </td>
                                                <td>
                                                    1992 - 1996
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    530i
                                                </td>
                                                <td>
                                                    M60B30 8-цилиндровый
                                                </td>
                                                <td>
                                                    218 л.с.
                                                </td>
                                                <td>
                                                    227 км/ч
                                                </td>
                                                <td>
                                                    8.3 сек
                                                </td>
                                                <td>
                                                    1993 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    540i
                                                </td>
                                                <td>
                                                    M60B40 8-цилиндровый
                                                </td>
                                                <td>
                                                    286 л.с.
                                                </td>
                                                <td>
                                                    240 км/ч**
                                                </td>
                                                <td>
                                                    7.0 сек
                                                </td>
                                                <td>
                                                    1993 - 1995
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    M5 3.8
                                                </td>
                                                <td>
                                                    S38B38 6-цилиндровый
                                                </td>
                                                <td>
                                                    340 л.с.
                                                </td>
                                                <td>
                                                    250 км/ч*
                                                </td>
                                                <td>
                                                    5.9 сек
                                                </td>
                                                <td>
                                                    1992 - 1995
                                                </td>
                                            </tr>
                                            <br>
                                            <tr>
                                                <td>
                                                    525td
                                                </td>
                                                <td>
                                                    M51D25 6-цилиндровый
                                                </td>
                                                <td>
                                                    115 л.с.
                                                </td>
                                                <td>
                                                    188 км/ч
                                                </td>
                                                <td>
                                                    13.7 сек
                                                </td>
                                                <td>
                                                    1993 - 1996
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>
                                                    525tds
                                                </td>
                                                <td>
                                                    M51D25 6-цилиндровый
                                                </td>
                                                <td>
                                                    143 л.с.
                                                </td>
                                                <td>
                                                    202 км/ч
                                                </td>
                                                <td>
                                                    11.6 сек
                                                </td>
                                                <td>
                                                    1993 - 1996
                                                </td>
                                            </tr>

                                        </tbody>
                                    </table>
                                    <br>
                                    * = регулируемый<br>
                                    ** = более поздние модели 540i были ограничены до 250 км/ч<br>
                                    ***= двухвалентный (природный газ/бензин)
                                </td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <div class="block">
                <button type="button" class="desc-button button-historydifferential" id="historydifferential"
                    @click="openBlock">Дифференциальная таблица</button>
                <div class="scroll-table">
                    <table cellspacing="0" cellpadding="5" width="600"
                        class="hidden-div historydifferential none hidden-table" id="historydifferential">
                        <tbody>
                            <tr>
                                <td valign="top" width="65%" class="no-border">
                                    <b>Передаточные числа трансмиссии и дифференциала</b>
                                    <br>
                                    В этой таблице показаны дифференциалы, установленные в каждом случае. Все модели
                                    Е34:<br><br>
                                    <table class="center">
                                        <tbody>
                                            <tr>
                                                <td>&nbsp;</td>

                                                <td>
                                                    2.64
                                                </td>
                                                <td>
                                                    2.79
                                                </td>
                                                <td>
                                                    2.93
                                                </td>
                                                <td>
                                                    3.07
                                                </td>
                                                <td>
                                                    3.15
                                                </td>
                                                <td>
                                                    3.23
                                                </td>
                                                <td>
                                                    3.25
                                                </td>
                                                <td>
                                                    3.38
                                                </td>
                                                <td>

                                                    3.45
                                                </td>
                                                <td>

                                                    3.46
                                                </td>
                                                <td>

                                                    3.64
                                                </td>
                                                <td>

                                                    3.73
                                                </td>
                                                <td>

                                                    3.91
                                                </td>
                                                <td>

                                                    4.10
                                                </td>
                                                <td>

                                                    4.27
                                                </td>
                                                <td>

                                                    4.44
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>

                                                    518g
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    X
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    518i M40
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="blue">S</span>
                                                    /
                                                    A
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="red">S</span>
                                                </td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>
                                                    518i M43
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    S
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    A

                                                </td>
                                            </tr>
                                            <tr>
                                                <td>

                                                    520i M20
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    X

                                                </td>
                                            </tr>
                                            <tr>
                                                <td>

                                                    520i M50
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="blue">S</span>
                                                </td>
                                                <td>
                                                    <span class="blue">A</span>
                                                    /T
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="red">S</span>
                                                </td>
                                                <td>
                                                    <span class="red">A</span>
                                                </td>
                                            </tr>
                                            <tr>
                                                <td>

                                                    525i M20
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    S

                                                </td>
                                                <td>

                                                    A

                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>
                                                    525i M50
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="blue">
                                                        S
                                                        /
                                                        A
                                                    </span>
                                                </td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="blue">TA</span>
                                                </td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="red">TA</span>
                                                </td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="red">S</span>
                                                </td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="red">A</span>
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>
                                                    525ix
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>
                                                    X
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>
                                            <tr>
                                                <td>

                                                    530i M30
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    S

                                                </td>
                                                <td>

                                                    A

                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    530i M60
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    S

                                                </td>
                                                <td>

                                                    A

                                                </td>
                                                <td>

                                                    T

                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    535i M30
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="red">S</span>
                                                </td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="blue">S</span>
                                                    /
                                                    <span class="red">A</span>
                                                </td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="blue">A</span>
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    540i M60
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    X

                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    M5 3.6 S38
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    X
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    M5 3.8 S38
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="blue">S</span>
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>
                                                    <span class="red">S</span>
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    524td M21
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    S
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    A
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    525td M51
                                                </td>
                                                <td>
                                                    S
                                                </td>
                                                <td>
                                                    T
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>

                                                <td>

                                                    A

                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>

                                            <tr>
                                                <td>

                                                    525tds M51
                                                </td>
                                                <td>
                                                    X
                                                </td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                                <td>&nbsp;</td>
                                            </tr>
                                        </tbody>
                                    </table>

                                    <br>
                                    S = Механика<br>
                                    A = Автомат<br>
                                    T = Туринг<br>
                                    TA = Туринг автомат<br>
                                    X = устанавливался только этот дифференциал, независимо от года выпуска и коробки
                                    передач<br><br>
                                    Если не указано иное, одинаковые передаточные числа применяются к автоматической
                                    коробке
                                    передач седана и туристической автоматической коробке передач. Исключение: ТА (525i
                                    M50
                                    и
                                    530i M60), здесь в седане-автомате и туринг-автомате одинаковые редукторы заднего
                                    моста
                                    не
                                    устанавливались.<br><br>
                                    В некоторых случаях коробки передач менялись в зависимости от года выпуска, а это
                                    означало,
                                    что передаточные числа заднего моста пришлось отрегулировать. Это отражено в таблице
                                    цвета
                                    выделено красным и синим цветом. Красный означает перевод до изменения, синий
                                    обозначает перевод после изменения.<br>
                                    Изменения коснулись следующих моделей следующих годов выпуска:<br><br>
                                    518i M40: 9/91<br>
                                    520i M50: 1/91<br>
                                    520iA M50: 9/90<br>
                                    525i M50 und 525iA M50: 9/90<br>
                                    525iA Туринг M50: 9/92<br>
                                    535i и 535iA: 9/89<br>
                                    M5 3.8 S38: 6/94<br><br>
                                    Пример из таблицы:<br>
                                    У 525i M50 в механической версии был дифференциал до 9/90.
                                    Установлено передаточное число 3,73:1, в автоматическом варианте 4,10:1. С 9/90 это
                                    было
                                    в
                                    Выключатель и автомат 3,23:1 используется также в Touring с механической коробкой
                                    передач.
                                    Автомат Touring показал результат 3:46:1. Однако для 525i Touring
                                    Автомат с 9/92, затем был установлен 3,38:1.<br><br>
                                </td>
                            </tr>
                        </tbody>
                    </table>
                </div>
            </div>
            <div class="block">
                <button type="button" class="desc-button button-historycolor" id="historycolor"
                    @click="openBlock">Таблица
                    цветов E34</button>
                <table cellspacing="0" class="hidden-div historycolor none hidden-table"
                    id="historycolor">
                    <tbody>
                        <tr>
                            <td class="no-border" valign="top">

                                <b>Простые цвета</b><br><br>

                                <table class="center" cellspacing="0"  width="250">
                                    <tbody>
                                        <tr>

                                            <td valign="top" width="60%">

                                                Цвет:<br><br>
                                                Alpinweiss II<br>
                                                Atlantisblau<br>
                                                Brillantrot<br>
                                                Dunkelgrün II<br>
                                                Glanzschwarz<br>
                                                Hellrot<br>
                                                Mineralblau<br>
                                                Misanorot<br>
                                                Nauticgrün<br>
                                                Schwarz<br>
                                                Tizianrot<br>
                                                Violettschwarz<br>
                                                Vulkangrau<br>
                                                Weinrot<br>
                                                Zinnoberrot<br>
                                            </td>
                                            <td>
                                                Номер:<br><br>
                                                218<br>
                                                207<br>
                                                308<br>
                                                307<br>
                                                668<br>
                                                314<br>
                                                231<br>
                                                236<br>
                                                322<br>
                                                086<br>
                                                315<br>
                                                304<br>
                                                329<br>
                                                224<br>
                                                138<br>
                                            </td>
                                        </tr>
                                    </tbody>
                                </table>

                                <br><br><br>


                                <b>Металлические цвета</b><br><br>

                                <table class="center" cellspacing="0" cellpadding="5" width="250">
                                    <tbody>
                                        <tr>
                                            <td valign="top" width="60%">

                                                Цвет:<br><br>

                                                Alaskablau<br>
                                                Ascotgrün<br>
                                                Aspensilber<br>
                                                Avusblau<br>
                                                Brokatrot<br>
                                                Bronzitbeige<br>
                                                Burgundrot<br>
                                                Calypsorot<br>
                                                Cirrusblau<br>
                                                Cordobarot<br>
                                                Cosmosschwarz<br>
                                                Daytonaviolett<br>
                                                Delphin<br>
                                                Diamantschwarz<br>
                                                Fjordgrau<br>
                                                Gletscherblau<br>
                                                Granitsilber<br>
                                                Islandgrün<br>
                                                Kaschmirbeige<br>
                                                Lachssilber<br>
                                                Lagunengrün<br>
                                                Lazurblau<br>
                                                Luxorbeige<br>
                                                Macaoblau<br>
                                                Malachitgrün<br>
                                                Maledivenblau<br>
                                                Maritiusblau<br>
                                                Mojavebraun<br>
                                                Montrealblau<br>
                                                Navarraviolett<br>
                                                Nepalsilber<br>
                                                Nogarosilber<br>
                                                Orientblau<br>
                                                Oxfordgrün<br>
                                                Petrol Mica<br>
                                                Royalblau<br>
                                                Sebringrau<br>
                                                Sorrentblau<br>
                                                Sterlingsilber<br>
                                            </td>
                                            <td>

                                                Номер:<br><br>
                                                367<br>
                                                353<br>
                                                339<br>
                                                276<br>
                                                259<br>
                                                139<br>
                                                199<br>
                                                252<br>
                                                189<br>
                                                286<br>
                                                303<br>
                                                283<br>
                                                184<br>
                                                181<br>
                                                310<br>
                                                280<br>
                                                237<br>
                                                273<br>
                                                301<br>
                                                203<br>
                                                266<br>
                                                294<br>
                                                219<br>
                                                250<br>
                                                205<br>
                                                290<br>
                                                287<br>
                                                331<br>
                                                297<br>
                                                346<br>
                                                374<br>
                                                243<br>
                                                317<br>
                                                324<br>
                                                305<br>
                                                198<br>
                                                229<br>
                                                360<br>
                                                244<br>
                                            </td>
                                        </tr>
                                    </tbody>
                                </table>

                                <br><br>
                                Не все цвета были доступны для всех типов кузова, годов выпуска и вариантов двигателей.
                                Специальные краски также можно заказать в BMW индивидуально.<br><br>
                            </td>
                        </tr>
                    </tbody>
                </table>
            </div>
        </main>

        <footer>
            <div class="footer-inside">
                <ul class="contacts-list list">
                    <li class="contacts-list__item" v-for="contact in contacts" :key="contact.id">
                        <a class="contact-link" :href="contact.href" :class="contact.name">
                            <span>
                                {{ contact.name }}
                            </span>
                        </a>
                    </li>
                </ul>
                <p class="time">Пишите круглосуточно, звоните с 11 до 24 ч</p>
            </div>
        </footer>

    </div>
</template>

<script>

export default {
    name: 'BaseView',

    data() {
        return {
            contacts: [
                {
                    name: "Telegram",
                    href: "https://t.me/mullerbmw"
                },
                {
                    name: "WhatsApp",
                    href: "https://wa.me/79772805434"
                },
            ],

            pages: [
                {
                    name: "В ПРОДАЖЕ",
                    to: "/"
                },
                {
                    name: "ВЫКУП",
                    to: "/vikup"
                },
                {
                    name: "БАЗА ЗНАНИЙ",
                    to: "/base"
                },
                {
                    name: "КОНТАКТЫ",
                    to: "/contacts"
                },
            ],
        }
    },

    methods: {
        openBlock: function (event) {
            console.log(event.target)
            let hiddenBlocks = document.querySelectorAll(".hidden-div");

            hiddenBlocks.forEach(function (block) {
                if (event.target.id === block.id) {
                    block.classList.toggle("none")
                }
            });
        },
    },
}
</script>